/*****************************************************************************/
/* 文件名:    out_ntp.h                                                      */
/* 描  述:    NTP相关处理头文件                                              */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#ifndef __OUT_NTP_H_
#define __OUT_NTP_H_



/*-------------------------------*/
/* 宏定义                        */
/*-------------------------------*/

/* 寄存器地址定义 */
#define OUT_NTP_TX_ENABLE_REG_ADDR     0x0154

#define OUT_NTP_MD5_ENABLE_REG_ADDR     0x0155




/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/


#endif
