/*****************************************************************************/
/* 文件名:    out_ntp.c                                                      */
/* 描  述:    NTP相关处理                                                    */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#include <includes.h>
#include "arch/cc.h"
#include "lwip/api.h"
#include "opt.h"
#include "out_ntp.h"
#include "bsp_spi.h"





/*-------------------------------*/
/* 变量定义                      */
/*-------------------------------*/



/*-------------------------------*/
/* 全局变量声明                  */
/*-------------------------------*/


/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/

/*****************************************************************************
 * 函  数:    out_set_ntp_tx_enable                                                         
 * 功  能:    NTP报文发送使能设置                                                                 
 * 输  入:    enable: 使能/不使能                          
 * 输  出:    无                                                    
 * 返回值:    无                                                    
 * 创  建:    2018-07-18 changzehai(DTT)                            
 * 更  新:    无                                       
 ****************************************************************************/
void out_set_ntp_tx_enable(u8_t enable)
{

    SPI_FPGA_ByteWrite(enable, OUT_NTP_TX_ENABLE_REG_ADDR);

}

/*****************************************************************************
 * 函  数:    out_set_md5_enable                                                         
 * 功  能:    NTP MD5加密使能                                                                 
 * 输  入:    enable: 使能/不使能                          
 * 输  出:    无                                                    
 * 返回值:    无                                                    
 * 创  建:    2018-07-18 changzehai(DTT)                            
 * 更  新:    无                                       
 ****************************************************************************/
void out_set_md5_enable(u8_t enable)
{

    SPI_FPGA_ByteWrite(enable, OUT_NTP_MD5_ENABLE_REG_ADDR);

}