/*****************************************************************************/
/* 文件名:    gnss_task.h                                                    */
/* 描  述:    卫星信息解析任务头文件                                         */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#ifndef __GNSS_TASK_H_
#define __GNSS_TASK_H_
#include <includes.h>


/*-------------------------------*/
/* 宏定义                        */
/*-------------------------------*/
#define    GNSS_TASK_STACK_SIZE   300 /* 卫星信息查询任务栈大小 */
#define    GNSS_TASK_PRIO         6    /* 卫星信息查询任务优先级 */


/*-------------------------------*/
/* 变量声明                      */
/*-------------------------------*/
extern OS_TCB            g_gnss_task_tcb;                       /* 卫星信息查询任务控制块 */

/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/
extern void gnss_main_task(void);
extern void gnss_task_create(void);

#endif
