/*****************************************************************************/
/* 文件名:    util_string.h                                                  */
/* 描  述:    字符串相关处理头文件                                           */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#ifndef __UTIL_STRING_H_
#define __UTIL_STRING_H_
#include "arch/cc.h"


/*-------------------------------*/
/* 宏定义                        */
/*-------------------------------*/


/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/
extern void util_strcpy(u8_t *p_dest, u8_t *p_src, u8_t stop_char, u8_t max_size);

#endif
