/*****************************************************************************/
/* 文件名:    util_string.c                                                  */
/* 描  述:    字符串相关处理                                                 */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#include "Util/util_string.h"




/*****************************************************************************
 * 函  数:    util_strcpy                                                          
 * 功  能:    复制字符串到指定字符为止                                                             
 * 输  入:     p_dest: 指向拷贝目的地址   
 *             p_src： 指向源字符串
 *             stop_char：指定停止字符
 *             max_size: 拷贝最大大小（为拷贝最大长度加1）
 * 输  出:    无                                                    
 * 返回值:    无                                                    
 * 创  建:    2018-07-18 changzehai(DTT)                            
 * 更  新:    无                                       
 ****************************************************************************/
void util_strcpy(u8_t *p_dest, u8_t *p_src, u8_t stop_char, u8_t max_size)
{
	u8_t i = 0;
	
	if((p_dest == NULL) || (p_src == NULL) )
	{
		return;
	}
		
	while((p_src[i] != stop_char) && (i < max_size-1))
	{
		p_dest[i] = p_src[i];
		i++;
	}

	p_dest[i] = '\0'; 
}



