/*****************************************************************************/
/* 文件名:    roll_count.c                                                   */
/* 描  述:    循环统计                                                       */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#include <includes.h>
#include "bsp_spi.h"
#include "Roll/roll_count.h"





/*-------------------------------*/
/* 变量定义                      */
/*-------------------------------*/



/*-------------------------------*/
/* 全局变量声明                  */
/*-------------------------------*/


/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/
static u8_t perf_sfp_read(u8_t read_addr);
//static void perf_sfp_write(u8_t w_byte, u8_t w_addr);







///*****************************************************************************
// * 函  数:    perf_get_sfp_alarm_signal                                                        
// * 功  能:   获取光模块告警信号                                                                 
// * 输  入:    无  
// * 输  出:    无                                                    
// * 返回值:    光模块告警信号                                                    
// * 创  建:    2018-07-18 changzehai(DTT)                            
// * 更  新:    无                                       
// ****************************************************************************/ 
//u8_t perf_get_sfp_alarm_signal()
//{
//    u8_t tmp = 0;
//    
//    SPI_FPGA_ByteRead(&tmp, PERF_SFP_ALARM_SIGNAL_REG_ADDR);
//    
//    return (tmp & 0x7);
//}

///*****************************************************************************
// * 函  数:    perf_set_sfp_tx_enable                                                       
// * 功  能:    光模块发送使能设置                                                                 
// * 输  入:    enable:  使能/不使能
// * 输  出:    无                                                    
// * 返回值:    无                                                    
// * 创  建:    2018-07-18 changzehai(DTT)                            
// * 更  新:    无                                       
// ****************************************************************************/ 
//void perf_set_sfp_tx_enable(u8_t enable)
//{
//    
//    SPI_FPGA_ByteWrite(enable, PERF_SFP_TX_ENABLE_REG_ADDR);
//}
