/*****************************************************************************/
/* 文件名:    roll_task.h                                                    */
/* 描  述:    循环任务头文件                                                 */
/* 创  建:    2018-07-20 changzehai(DTT)                                     */
/* 更  新:    无                                                             */
/* Copyright 1998 - 2018 DTT. All Rights Reserved                            */
/*****************************************************************************/
#ifndef __ROLL_TASK_H_
#define __ROLL_TASK_H_
#include <includes.h>


/*-------------------------------*/
/* 宏定义                        */
/*-------------------------------*/
#define    ROLL_TASK_STACK_SIZE   300  /* 循环任务栈大小 */
#define    ROLL_TASK_PRIO         10    /* 循环任务优先级 */

/*-------------------------------*/
/* 变量声明                      */
/*-------------------------------*/
extern OS_TCB            g_roll_task_tcb;                       /* 循环任务控制块 */

/*-------------------------------*/
/* 函数声明                      */
/*-------------------------------*/
extern void roll_task_create(void);

#endif
